
{
  "personal": {
    "name": "Shishir Tamrakar",
    "title": "Software Developer & UI/UX Designer",
    "location": "Kathmandu, Nepal",
    "description": "A passionate problem-solver crafting innovative software solutions with a focus on exceptional user experience and performance. Based in Kathmandu, Nepal.",
    "github": "https://github.com/MythicSTR",
    "linkedin": "https://linkedin.com/in/shishirtamrakar"
  },
  "about": {
    "paragraphs": [
      "I'm a Computer Science undergraduate at Kathmandu University with a passion for building elegant, user-friendly software solutions. My journey in tech started with web development and has evolved to encompass UI/UX design and machine learning.",
      "I believe in creating technology that solves real problems while delivering exceptional user experiences. When I'm not coding, you can find me exploring new technologies, contributing to open-source projects, or hiking in Nepal's beautiful mountains."
    ],
    "coreSkills": ["Java", "Python", "JavaScript", "Spring Boot", "Django", "Node.js", "React.js", "UI/UX Design"]
  },
  "experience": [
    {
      "title": "Salesforce Developer Intern",
      "company": "ComplianceQuest, Inc.",
      "duration": "Apr 2025 - Jul 2025",
      "description": [
        "Gained hands-on experience by learning Salesforce platform fundamentals, including declarative development and Apex programming",
        "Designed and developed a Salesforce-native restaurant management system using Apex, Flows, and Lightning Web Components"
      ],
      "technologies": ["Salesforce", "Apex", "SOQL/SOSL", "LWC"]
    },
    {
      "title": "UI/UX Designer (Freelance)",
      "company": "StartIn Lab",
      "duration": "Dec 2024 - Feb 2025",
      "description": [
        "Sole designer for a social media platform designed to connect entrepreneurs and students, focusing on networking, event participation, and collaboration",
        "Designed intuitive profile creation, matching, event listing, RSVP, and a chat UI pages in Figma, optimizing for user engagement and seamless interaction without overwhelming the user",
        "Collaborated with clients in regular stand-ups, iterating on designs, conducting design reviews and introspection to ensure alignment with their vision"
      ],
      "technologies": ["Figma", "UI/UX Design", "Prototyping", "User Research"]
    },
    {
      "title": "Internship",
      "company": "SmartChoice Technologies",
      "duration": "Nov 2024 - Jan 2025",
      "description": [
        "Bridged the gap between business and development teams by translating client needs into clear technical documentation, and facilitated the integration of two digital wallet providers with the company's payment system",
        "Collaborated with engineering teams to validate API integrations, troubleshoot transaction issues, and optimize payment flow logic",
        "Assisted in preparing a detailed WebSocket specification for real-time transaction status updates, including architecture, message flows, and API interactions"
      ],
      "technologies": ["API Integration", "Technical Documentation", "WebSocket", "Payment Systems"]
    }
  ],
  "projects": [
    {
      "id": "shopping-cart",
      "title": "Shopping Cart Backend System",
      "description": "A comprehensive backend system with microservices architecture for e-commerce platforms.",
      "longDescription": "Developed robust microservices architecture for product, payment, and order management services using Spring Boot. Designed and implemented RESTful APIs, leveraging Spring Data JPA and Hibernate ORM for efficient data persistence and MySQL for relational storage.",
      "technologies": ["Java", "Spring Boot", "Spring Data JPA", "Hibernate", "MySQL", "Microservices Architecture", "RESTful APIs"],
      "githubUrl": "https://github.com/MythicSTR/shopping-cart-backend"
    },
    {
      "id": "gesture-recognition",
      "title": "Gesture-Controlled Digital Interaction System",
      "description": "AI-powered system for real-time hand gesture recognition using computer vision techniques.",
      "longDescription": "Developed a real-time gesture recognition system, enabling touches computer interaction via hand gestures. Implemented a Conv3D + LSTM hybrid model trained on a Kaggle dataset, applying proper data augmentation techniques, and achieving an overall 75% accuracy.",
      "technologies": ["Python", "OpenCV", "NumPy", "TensorFlow"],
      "githubUrl": "https://github.com/MythicSTR"
    },
    {
      "id": "munchy",
      "title": "Munchy",
      "description": "On-Site Restaurant Ordering System for seamless ordering and management.",
      "longDescription": "Developed a real-time restaurant ordering application enabling customers to browse menus, customize orders, and place them instantly. Designed a responsive and interactive UI, integrated live order tracking, and dynamic menu updates, ensuring instant transmission to restaurant systems for faster processing and efficient order management.",
      "technologies": ["FlutterFlow", "Firebase"],
      "githubUrl": "https://github.com/MythicSTR"
    },
    {
      "id": "unify",
      "title": "Unify",
      "description": "Classroom Allocation Management System with dynamic scheduling and resource management.",
      "longDescription": "Built RESTful API endpoints with Django for dynamic classroom scheduling and real-time data management, ensuring smooth interaction with the frontend. Utilized PostgreSQL for robust data storage and Django's ORM for efficient querying and management of classroom, schedule, and resource data.",
      "technologies": ["Django", "React.js", "PostgreSQL", "RESTful APIs"],
      "githubUrl": "https://github.com/MythicSTR/Unify"
    },
    {
      "id": "unilife",
      "title": "Unilife",
      "description": "E-commerce and Local Discovery Platform with authentication and search functionality.",
      "longDescription": "Developed a full-stack platform combining e-commerce and hostel search functionalities, enabling efficient handling of user authentication, product listings, and hostel search queries. Utilized JWT for secure, stateless authentication, and MongoDB to store and manage product and hostel data, ensuring seamless retrieval and updates.",
      "technologies": ["React.js", "Node.js", "Express", "MongoDB", "JWT"],
      "githubUrl": "https://github.com/MythicSTR/Unilife"
    },
    {
      "id": "fordays",
      "title": "Fordays Japanese Language Classroom Portal",
      "description": "Single-page application for a Japanese language classroom at Kathmandu University.",
      "longDescription": "Developed a single-page application to showcase the Fordays Japanese language classroom at Kathmandu University. Designed and implemented user-friendly interface for sections including About Us, Students & Alumni, and Events, providing a seamless user experience.",
      "technologies": ["React.js", "Tailwind CSS"],
      "githubUrl": "https://github.com/MythicSTR/fordays-site",
      "liveUrl": "https://japaneselanguage.ku.edu.np/"
    }
  ],
  "skills": [
    {
      "name": "Languages",
      "icon": "Code",
      "color": "bg-gradient-to-r from-blue-400 to-indigo-500",
      "skills": ["Java", "Python", "JavaScript", "SQL"]
    },
    {
      "name": "Backend",
      "icon": "Server",
      "color": "bg-gradient-to-r from-green-400 to-emerald-500",
      "skills": ["Spring Boot", "Spring Data JPA", "Hibernate", "Django", "Node.js", "JSP & Servlet"]
    },
    {
      "name": "Frontend",
      "icon": "Layout",
      "color": "bg-gradient-to-r from-purple-400 to-violet-500",
      "skills": ["React.js", "Tailwind CSS", "Figma (UI/UX Design)"]
    },
    {
      "name": "Databases",
      "icon": "Database",
      "color": "bg-gradient-to-r from-orange-400 to-pink-500",
      "skills": ["MySQL", "PostgreSQL", "MongoDB", "Firebase"]
    },
    {
      "name": "Tools & Libraries",
      "icon": "Globe",
      "color": "bg-gradient-to-r from-cyan-400 to-blue-500",
      "skills": ["IntelliJ IDEA", "Eclipse", "Maven", "Apache Tomcat", "Git", "Postman", "VS Code", "Vim"]
    },
    {
      "name": "Practices",
      "icon": "Lightbulb",
      "color": "bg-gradient-to-r from-yellow-400 to-amber-500",
      "skills": ["Agile Development", "Object-Oriented Programming", "Microservices Architecture", "Version Control"]
    }
  ],
  "education": [
    {
      "icon": "GraduationCap",
      "title": "Bachelor of Science in Computer Science",
      "institution": "Kathmandu University",
      "duration": "Dec 2020 - Present",
      "description": "Related Coursework: Object Oriented Programming, Data Structures and Algorithms, Database Management Systems, Software Engineering"
    }
  ],
  "story": [
    {
      "id": "japanese-speech-contest",
      "title": "3rd Place - 43rd All Nepalese Japanese Language Speech Competition",
      "date": "2024-04",
      "description": "Delivered a speech on my Japanese language learning journey at the 43rd All Nepalese Japanese Language Speech Competition. The event brought together passionate learners from across the country, and I was honored to secure third place in the junior level category.",
      "highlights": [
        "Spoke on the theme of personal Japanese language learning journey",
        "Competed among nationwide Japanese learners",
        "Earned third place in the junior level category",
        "Enhanced public speaking and language expression skills"
      ],
      "type": "achievement",
      "icon": "mic",
      "image": "/assets/story/43rd_Japanese_Language_Speech_Competition.jpg"
    },
    {
      "id": "first-japan-visit",
      "title": "First Visit to Japan - Language & Culture Exchange",
      "date": "2024-07",
      "description": "Participated in a 7-day language and cultural exchange tour in Japan, organized by Fordays Japan in collaboration with Kathmandu University. This eye-opening journey offered direct exposure to Japanese culture, language immersion, and firsthand experiences that deepened my appreciation for Japan’s social and cultural richness.",
      "highlights": [
        "Visited renowned IT companies and discussed the Japanese IT job market",
        "Explored Tokyo landmarks like Asakusa, Shibuya, and Shinjuku",
        "Practiced Japanese in real-world settings with native speakers",
        "Experienced traditional culture through ceremonies, arts, and local interactions"
      ],
      "type": "travel",
      "icon": "plane",
      "image": "/assets/story/Arrival_To_Japan.jpg"
    },
    {
      "id": "fordays-scholarship",
      "title": "Fordays Japanese Language Scholarship",
      "date": "2024-07",
      "description": "Awarded the Fordays Japanese Language Course Scholarship (フォーデイズ日本語奨学金) by Fordays Co., Ltd., in recognition of my dedication to Japanese language learning and cultural engagement. The scholarship was offered in collaboration with Kathmandu University.",
      "highlights": [
        "Recognized for commitment to Japanese language and cultural understanding",
        "Selected through Kathmandu University under Fordays Japan’s education initiative",
        "Formal endorsement by Fordays Co., Ltd.",
        "Supported further studies in Japanese language and cultural exchange"
      ],
      "type": "achievement",
      "icon": "book",
      "image": "/assets/story/Received_Fordays_Scholarship.jpg"
    }
  ]
}
